
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Делает запись об изменившейся настройке обмена
//
// Параметры:
//  ВидНастройки - ПеречислениеСсылка.ВидыНастроекОбмена - Измененная настройка обмена.
//
Процедура ДобавитьЗапись(ВидНастройки) Экспорт

	МенеджерЗаписи = РегистрыСведений.ИзмененныеНастройкиСинхронизации.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ВидНастройки = ВидНастройки;
	МенеджерЗаписи.Записать();

	РегистрыСведений.ПротоколСобытий.ДобавитьИнформацию(
		СтрШаблон(
			НСтр("ru = 'Записано изменение настройки ""%1""'; 
			     |en = 'Change of parameter is registered for ""%1""'"),
			Строка(ВидНастройки)));

КонецПроцедуры

#КонецОбласти

#КонецЕсли

