
#Область ПрограммныйИнтерфейс

// Возвращает пустой уникальный идентификатор.
// 
// Возвращаемое значение:
//  Строка - Пустой уникальный идентификатор.
//
Функция УникальныйИдентификаторПустой() Экспорт

	Возврат Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");

КонецФункции

// Возвращает признак большой диагонали экрана у устройства.
//
// Возвращаемое значение:
//	Истина - Если экран устройства имеет диагональ больше 7 дюймов.
//
Функция ЭтоУстройствоСБольшимЭкраном() Экспорт

	Возврат ЭкранКлиентСервер.УстройствоИмеетЭкранБольшеСемиДюймов();

КонецФункции 

#КонецОбласти
