
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

#Область ОбработчикиСобытийОбъекта

Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Движения.БалансОбъектовСтроительства.Записывать = Истина;
	//Движения.Взаиморасчеты.Записывать = Истина;
	//
	//// Баланс объектов строительства
	//Движение = Движения.БалансОбъектовСтроительства.Добавить();
	//Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//Движение.Период = Дата;
	//Движение.Объект = Объект;
	//Движение.Контрагент = Контрагент;
	//Движение.ТипПлатежа = ТипПлатежа;
	//Движение.СтатьяДоходовРасходов = СтатьяРасходов;
	//Движение.Количество = Сумма;
	//
	//// Взаиморасчеты с контрагентами
	//Движение = Движения.Взаиморасчеты.Добавить();
	//Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//Движение.Период = Дата;
	//Движение.Объект = Объект;
	//Движение.Контрагент = Контрагент;
	//Движение.Количество = Сумма;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Объекты") Тогда
		Объект = ДанныеЗаполнения.Ссылка;
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// todo: если будет детализация, это пригодится
	//Сумма = 0;
	//Для Каждого Строка Из Состав Цикл
	//	Сумма = Сумма + Строка.Стоимость;
	//КонецЦикла;
		
КонецПроцедуры

#КонецОбласти