
#Область ОбработчикиКомандФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СтрокаКоманды = ТаблицаКоманд.Добавить();
	СтрокаКоманды.Картинка = БиблиотекаКартинок.Документ;
	СтрокаКоманды.ОписаниеКоманды = НСтр("ru = 'Заявка на обслуживание'");
	СтрокаКоманды.Команда  = "НовыйЗаявкаНаОбслуживание";
	
	СтрокаКоманды = ТаблицаКоманд.Добавить();
	СтрокаКоманды.Картинка = БиблиотекаКартинок.Документ;
	СтрокаКоманды.ОписаниеКоманды = НСтр("ru = 'Заключение договора аренды'");
	СтрокаКоманды.Команда  = "НовыйЗаключениеДоговораАренды";
	
	СтрокаКоманды = ТаблицаКоманд.Добавить();
	СтрокаКоманды.Картинка = БиблиотекаКартинок.Документ;
	СтрокаКоманды.ОписаниеКоманды = НСтр("ru = 'Дополнительное соглашение'");
	СтрокаКоманды.Команда  = "НовыйДополнительноеСоглашение";
	
	СтрокаКоманды = ТаблицаКоманд.Добавить();
	СтрокаКоманды.Картинка = БиблиотекаКартинок.Документ;
	СтрокаКоманды.ОписаниеКоманды = НСтр("ru = 'Расторжение договора аренды'");
	СтрокаКоманды.Команда  = "НовыйРасторжениеДоговораАренды";
	
	СтрокаКоманды = ТаблицаКоманд.Добавить();
	СтрокаКоманды.Картинка = БиблиотекаКартинок.Документ;
	СтрокаКоманды.ОписаниеКоманды = НСтр("ru = 'Счет на аренду'");
	СтрокаКоманды.Команда  = "НовыйСчетНаАренду";
		
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ТаблицаКомандВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ТекущиеДанные = Элементы.ТаблицаКоманд.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Команда = "НовыйЗаявкаНаОбслуживание" Тогда
		СборСтатистикиВызовСервера.ЗаписатьПоказатель("Форма.СозданиеНового.НовыйЗаявкаНаОбслуживание");
		ОткрытьФорму("Документ.ЗаявкаНаОбслуживание.Форма.ФормаДокумента");
		
	ИначеЕсли ТекущиеДанные.Команда = "НовыйЗаключениеДоговораАренды" Тогда
		СборСтатистикиВызовСервера.ЗаписатьПоказатель("Форма.СозданиеНового.НовыйЗаключениеДоговораАренды");
		ОткрытьФорму("Документ.ЗаключениеДоговораАренды.Форма.ФормаДокумента");
		
	ИначеЕсли ТекущиеДанные.Команда = "НовыйДополнительноеСоглашение" Тогда
		СборСтатистикиВызовСервера.ЗаписатьПоказатель("Форма.СозданиеНового.НовыйДополнительноеСоглашение");
		ОткрытьФорму("Документ.ДополнительноеСоглашение.Форма.ФормаДокумента");
		
	ИначеЕсли ТекущиеДанные.Команда = "НовыйРасторжениеДоговораАренды" Тогда
		СборСтатистикиВызовСервера.ЗаписатьПоказатель("Форма.СозданиеНового.НовыйРасторжениеДоговораАренды");
		ОткрытьФорму("Документ.РасторжениеДоговораАренды.Форма.ФормаДокумента");
		
	ИначеЕсли ТекущиеДанные.Команда = "НовыйСчетНаАренду" Тогда
		СборСтатистикиВызовСервера.ЗаписатьПоказатель("Форма.СозданиеНового.НовыйСчетНаАренду");
		ОткрытьФорму("Документ.СчетНаАренду.Форма.ФормаДокумента");
				
	КонецЕсли;

	ПодключитьОбработчикОжидания("ЗакрытьФорму", 0.2, Истина);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗакрытьФорму()

	ЭтаФорма.Закрыть();

КонецПроцедуры

#КонецОбласти

