
#Область ПрограммныйИнтерфейс

// Обработчик открытия гиперссылки в тексте письма.
//
// Параметры:
//  Гиперссылка			 - Строка - Анализируемая гиперссылка;
//  СтандартнаяОбработка - Булево - Признак стандартной обработки;
//  Объект				 - СправочникСсылка.Файлы - Ссылка на открываемый файл.
//
Процедура ОткрытьСсылку(Гиперссылка, СтандартнаяОбработка, Объект = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(Гиперссылка) Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;

	СхемаСсылки = РаботаСHTMLКлиентСервер.ОпределитьСхемуСсылки(Гиперссылка);

	Если СхемаСсылки = "v8doc:"
		И СтрНайти(Гиперссылка, "mailattachment") > 0 Тогда

		ЧастиСсылки   = СтрРазделить(Гиперссылка, "/");
		НомерВложения = Число(ЧастиСсылки[ЧастиСсылки.Количество()-1]);
		ИмяФайла      = ОбщегоНазначенияВызовСервера.ПолучитьИмяВременногоФайлаДляВложения(Объект);

		РаботаСФайламиИПредметамиКлиент.ЗапуститьПриложениеПоИмениФайла(ИмяФайла);

	ИначеЕсли СхемаСсылки = "http://"
		Или СхемаСсылки = "https://"
		Или СхемаСсылки = "ftp://" Тогда

		ЗапуститьПриложение(Гиперссылка);

	ИначеЕсли СхемаСсылки = "mailto:" Тогда
		// РаботаСПочтойКлиент.СоздатьПисьмоНаОснованииСсылкиMailto(Гиперссылка);

	Иначе
		СтандартнаяОбработка = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
