
#Область ПрограммныйИнтерфейс

// Выполняет обновление информационной базы после обновления конфигурации, если была поднята версия.
//
// Параметры:
//  СтраницыЧтоНового		 - Массив - Список имен страниц для отображения в форме "что нового";
//  ЕстьОшибкиПриОбновлении	 - Булево - Признак наличия ошибок при выполнении обновления.
//
Процедура ВыполнитьОбновлениеИнформационнойБазы(СтраницыЧтоНового, ЕстьОшибкиПриОбновлении) Экспорт

	// Открываем форму с пояснением о том, что идет процесс обновления.
	ОткрытьФорму("ОбщаяФорма.ОбновлениеИБ",,,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

	// Выполняем обновление данных.
	ОбновлениеИнформационнойБазыВызовСервера.ВыполнитьОбновлениеИБ(
		СтраницыЧтоНового, ЕстьОшибкиПриОбновлении);

	// Оповещаем все заинтересованные объекты, что обновление завершено.
	Оповестить("ОбновлениеЗавершено");

КонецПроцедуры

// Обработчик завершения показа формы "Что нового".
//
// Параметры:
//  Результат				 - Произвольный - Результат закрытия формы;
//  ДополнительныеПараметры	 - Структура, Неопределено - Дополнительные параметры.
//
Процедура ОбработатьПоказФормыЧтоНового(Результат, ДополнительныеПараметры) Экспорт

	ОбработчикЗавершения = Новый ОписаниеОповещения("ОбработатьЗавершениеПоказаФормыЧтоНового",
		 ОбновлениеИнформационнойБазыКлиент);
	
	ТекстЗаголовка      = НСтр("ru = 'Обновление данных'; en = 'Updating'");
	ТекстПредупреждения = НСтр("ru = 'Данные успешно обновлены. Можно продолжить работу.'; en = 'Data are successfully updated.'");

	// Покажем сообщение о том, что все обновлено.
	ПоказатьПредупреждение(ОбработчикЗавершения, ТекстПредупреждения, , ТекстЗаголовка);

КонецПроцедуры

// Обработчик закрытия предупреждения о выполнении обновления ИБ.
//
// Параметры:
//  Результат - Произвольный - Результат закрытия окна предупреждения.
//
Процедура ОбработатьЗавершениеПоказаФормыЧтоНового(Результат) Экспорт

	Оповестить("ВыполненЗапускСистемы");

КонецПроцедуры

#КонецОбласти



