
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче 
	// параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	ТипОС = Константы.ИмяОперационнойСистемы.Получить();

	ЗаполнитьСписокНедавних();
	
	УстановитьЗаголовок = Параметры.Свойство("Заголовок");

	Если Параметры.Свойство("Исполнители") Тогда
		Для Каждого Исполнитель Из Параметры.Исполнители Цикл
			Для Каждого Строка Из НедавниеИсполнители Цикл
				Строка.Выбран = Строка.Исполнитель = Исполнитель;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;

	Элементы.ИсполнителиТаблица.Видимость = Не НедавниеИсполнители.Количество() = 0;
	Если УстановитьЗаголовок Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОдинИсполнительАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)

	// РаботаСЗадачамиВызовСервера.НовыйИсполнительАвтоПодбор(Текст, ДанныеВыбора, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ОдинИсполнительОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	// РаботаСЗадачамиКлиент.НовыйИсполнительСтрокойОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка, ЭтаФорма);

	Если ЗначениеЗаполнено(НовыйИсполнитель) Тогда
		ЗакрытьИВернутьСписокВыбранных();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИсполнителиТаблица

&НаКлиенте
Процедура ИсполнителиТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ТекущиеДанные = Элементы.ИсполнителиТаблица.ТекущиеДанные;

	ТекущиеДанные.Выбран = Не ТекущиеДанные.Выбран;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)

	ЗакрытьИВернутьСписокВыбранных();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗакрытьИВернутьСписокВыбранных()

	СписокКВозврату = Новый СписокЗначений;
	Для Каждого СтрокаИсполнитель Из НедавниеИсполнители Цикл
		Если СтрокаИсполнитель.Выбран Тогда
			СписокКВозврату.Добавить(СтрокаИсполнитель.Исполнитель);
		КонецЕсли
	КонецЦикла;

	Если ЗначениеЗаполнено(НовыйИсполнитель) Тогда
		СписокКВозврату.Добавить(НовыйИсполнитель);
	КонецЕсли;
	
	Если СписокКВозврату.Количество() > 0 Тогда
		Оповестить("ВыбраныИсполнители", СписокКВозврату);
	Иначе
		Оповестить("ВыбраныИсполнители", Неопределено);
	КонецЕсли;

	Закрыть();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокНедавних()

	НедавниеИсполнители.Очистить();

	Счетчик = 0;
	Выборка = РегистрыСведений.ДатыИспользованияПользователейИРолейВЗадачах.Выбрать(, "ДатаИспользования Убыв");

	Пока Выборка.Следующий() Цикл

		Если Не ЭтоУстройствоСБольшимЭкраном() И Счетчик = 10
			Или ЭтоУстройствоСБольшимЭкраном() И Счетчик = 30 Тогда
			Прервать;
		КонецЕсли;

		НоваяСтрока = НедавниеИсполнители.Добавить();
		НоваяСтрока.Исполнитель = Выборка.Объект;

		Счетчик = Счетчик + 1;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти




