
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка 
		Или ДополнительныеСвойства.Свойство("ОчисткаБазы") Тогда
		Возврат;
	КонецЕсли;

	Если ДополнительныеСвойства.Свойство("ЭтоНовыйОбъект") 
		И ДополнительныеСвойства.ЭтоНовыйОбъект Тогда

		Если ДополнительныеСвойства.Свойство("Загрузка") 
			И ДополнительныеСвойства.Загрузка Тогда

			РаботаСПротоколомСобытийВызовСервера.ДобавитьЗаписьРасширенногоПротокола(
				Ссылка, 
				ТекстыСообщенийКлиентСерверПовтИсп.ТекстПротоколаЗагруженНовыйОбъект());

		Иначе
			РаботаСПротоколомСобытийВызовСервера.ДобавитьЗаписьРасширенногоПротокола(Ссылка, 
				ТекстыСообщенийКлиентСерверПовтИсп.ТекстПротоколаСозданНовыйОбъект());
		КонецЕсли;

	Иначе

		Если ДополнительныеСвойства.Свойство("Загрузка") 
			И ДополнительныеСвойства.Загрузка Тогда

			РаботаСПротоколомСобытийВызовСервера.ДобавитьЗаписьРасширенногоПротокола(
				Ссылка, 
				ТекстыСообщенийКлиентСерверПовтИсп.ТекстПротоколаЗагруженоИзменениеОбъекта());

		Иначе

			РаботаСПротоколомСобытийВызовСервера.ДобавитьЗаписьРасширенногоПротокола(
				Ссылка,
				ТекстыСообщенийКлиентСерверПовтИсп.ТекстПротоколаОбъектИзмененНаКлиенте());

		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры
