
#Область ПрограммныйИнтерфейс

// Возвращает соответствие для замены спецсимволов.
// 
// Возвращаемое значение:
//  Соответствие - Соответствие кодов и имен спецсимволов.
//
Функция ПолучитьСпецСимволыВВидеПарыКодПредставление() Экспорт

	Результат = Новый Соответствие;
	
	Результат.Вставить(193 , "Aacute");
	Результат.Вставить(225 , "aacute");
	Результат.Вставить(226 , "acirc");
	Результат.Вставить(194 , "Acirc");
	Результат.Вставить(180 , "acute");
	Результат.Вставить(230 , "aelig");
	Результат.Вставить(198 , "AElig");
	Результат.Вставить(192 , "Agrave");
	Результат.Вставить(224 , "agrave");
	Результат.Вставить(8501, "alefsym");
	Результат.Вставить(913 , "Alpha");
	Результат.Вставить(945 , "alpha");
	Результат.Вставить(8743, "and");
	Результат.Вставить(8736, "ang");
	Результат.Вставить(229 , "aring");
	Результат.Вставить(197 , "Aring");
	Результат.Вставить(8776, "asymp");
	Результат.Вставить(195 , "Atilde");
	Результат.Вставить(227 , "atilde");
	Результат.Вставить(196 , "Auml");
	Результат.Вставить(228 , "auml");

	Результат.Вставить(8222, "bdquo");
	Результат.Вставить(914 , "Beta");
	Результат.Вставить(946 , "beta");
	Результат.Вставить(166 , "brvbar");
	Результат.Вставить(8226, "bull");

	Результат.Вставить(8745, "cap");
	Результат.Вставить(199 , "Ccedil");
	Результат.Вставить(231 , "ccedil");
	Результат.Вставить(184 , "cedil");
	Результат.Вставить(162 , "cent");
	Результат.Вставить(967 , "chi");
	Результат.Вставить(935 , "Chi");
	Результат.Вставить(710 , "circ");
	Результат.Вставить(9827, "clubs");
	Результат.Вставить(8773, "cong");
	Результат.Вставить(169 , "copy");
	Результат.Вставить(8629, "crarr");
	Результат.Вставить(8746, "cup");
	Результат.Вставить(164 , "curren");

	Результат.Вставить(8224, "dagger");
	Результат.Вставить(8225, "Dagger");
	Результат.Вставить(8659, "dArr");
	Результат.Вставить(8595, "darr");
	Результат.Вставить(176 , "deg");
	Результат.Вставить(916 , "Delta");
	Результат.Вставить(948 , "delta");
	Результат.Вставить(9830, "diams");
	Результат.Вставить(247 , "divide");

	Результат.Вставить(233 , "eacute");
	Результат.Вставить(201 , "Eacute");
	Результат.Вставить(202 , "Ecirc");
	Результат.Вставить(234 , "ecirc");
	Результат.Вставить(232 , "egrave");
	Результат.Вставить(200 , "Egrave");
	Результат.Вставить(8709, "empty");
	Результат.Вставить(8195, "emsp");
	Результат.Вставить(8194, "ensp");
	Результат.Вставить(949 , "epsilon");
	Результат.Вставить(917 , "Epsilon");
	Результат.Вставить(8801, "equiv");
	Результат.Вставить(919 , "Eta");
	Результат.Вставить(951 , "eta");
	Результат.Вставить(240 , "eth");
	Результат.Вставить(208 , "ETH");
	Результат.Вставить(235 , "euml");
	Результат.Вставить(203 , "Euml");
	Результат.Вставить(8364, "euro");
	Результат.Вставить(8707, "exist");

	Результат.Вставить(402 , "fnof");
	Результат.Вставить(8704, "forall");
	Результат.Вставить(189 , "frac12");
	Результат.Вставить(188 , "frac14");
	Результат.Вставить(190 , "frac34");
	Результат.Вставить(8260, "frasl");

	Результат.Вставить(915 , "Gamma");
	Результат.Вставить(947 , "gamma");
	Результат.Вставить(8805, "ge");
	Результат.Вставить(62  , "gt");

	Результат.Вставить(8660, "hArr");
	Результат.Вставить(8596, "harr");
	Результат.Вставить(9829, "hearts");
	Результат.Вставить(8230, "hellip");

	Результат.Вставить(237 , "iacute");
	Результат.Вставить(205 , "Iacute");
	Результат.Вставить(238 , "icirc");
	Результат.Вставить(206 , "Icirc");
	Результат.Вставить(161 , "iexcl");
	Результат.Вставить(204 , "Igrave");
	Результат.Вставить(236 , "igrave");
	Результат.Вставить(8465, "image");
	Результат.Вставить(8734, "infin");
	Результат.Вставить(8747, "int");
	Результат.Вставить(921 , "Iota");
	Результат.Вставить(953 , "iota");
	Результат.Вставить(191 , "iquest");
	Результат.Вставить(8712, "isin");
	Результат.Вставить(207 , "Iuml");
	Результат.Вставить(239 , "iuml");

	Результат.Вставить(922 , "Kappa");
	Результат.Вставить(954 , "kappa");

	Результат.Вставить(955 , "lambda");
	Результат.Вставить(923 , "Lambda");
	Результат.Вставить(9001, "lang");
	Результат.Вставить(171 , "laquo");
	Результат.Вставить(8592, "larr");
	Результат.Вставить(8656, "lArr");
	Результат.Вставить(8968, "lceil");
	Результат.Вставить(8220, "ldquo");
	Результат.Вставить(8804, "le");
	Результат.Вставить(8970, "lfloor");
	Результат.Вставить(8727, "lowast");
	Результат.Вставить(9674, "loz");
	Результат.Вставить(8206, "lrm");
	Результат.Вставить(8249, "lsaquo");
	Результат.Вставить(8216, "lsquo");
	Результат.Вставить(60  , "lt");

	Результат.Вставить(175 , "macr");
	Результат.Вставить(8212, "mdash");
	Результат.Вставить(181 , "micro");
	Результат.Вставить(183 , "middot");
	Результат.Вставить(8722, "minus");
	Результат.Вставить(924 , "Mu");
	Результат.Вставить(956 , "mu");

	Результат.Вставить(8711, "nabla");
	Результат.Вставить(160 , "nbsp");
	Результат.Вставить(8211, "ndash");
	Результат.Вставить(8800, "ne");
	Результат.Вставить(8715, "ni");
	Результат.Вставить(172 , "not");
	Результат.Вставить(8713, "notin");
	Результат.Вставить(8836, "nsub");
	Результат.Вставить(241 , "ntilde");
	Результат.Вставить(209 , "Ntilde");
	Результат.Вставить(925 , "Nu");
	Результат.Вставить(957 , "nu");

	Результат.Вставить(243 , "oacute");
	Результат.Вставить(211 , "Oacute");
	Результат.Вставить(212 , "Ocirc");
	Результат.Вставить(244 , "ocirc");
	Результат.Вставить(338 , "OElig");
	Результат.Вставить(339 , "oelig");
	Результат.Вставить(242 , "ograve");
	Результат.Вставить(210 , "Ograve");
	Результат.Вставить(8254, "oline");
	Результат.Вставить(969 , "omega");
	Результат.Вставить(937 , "Omega");
	Результат.Вставить(927 , "Omicron");
	Результат.Вставить(959 , "omicron");
	Результат.Вставить(8853, "oplus");
	Результат.Вставить(8744, "or");
	Результат.Вставить(170 , "ordf");
	Результат.Вставить(186 , "ordm");
	Результат.Вставить(216 , "Oslash");
	Результат.Вставить(248 , "oslash");
	Результат.Вставить(213 , "Otilde");
	Результат.Вставить(245 , "otilde");
	Результат.Вставить(8855, "otimes");
	Результат.Вставить(214 , "Ouml");
	Результат.Вставить(246 , "ouml");

	Результат.Вставить(182 , "para");
	Результат.Вставить(8706, "part");
	Результат.Вставить(8240, "permil");
	Результат.Вставить(8869, "perp");
	Результат.Вставить(966 , "phi");
	Результат.Вставить(934 , "Phi");
	Результат.Вставить(928 , "Pi");
	Результат.Вставить(960 , "pi");
	Результат.Вставить(982 , "piv");
	Результат.Вставить(177 , "plusmn");
	Результат.Вставить(163 , "pound");
	Результат.Вставить(8243, "Prime");
	Результат.Вставить(8242, "prime");
	Результат.Вставить(8719, "prod");
	Результат.Вставить(8733, "prop");
	Результат.Вставить(968 , "psi");
	Результат.Вставить(936 , "Psi");

	Результат.Вставить(34  , "quot");

	Результат.Вставить(8730, "radic");
	Результат.Вставить(9002, "rang");
	Результат.Вставить(187 , "raquo");
	Результат.Вставить(8658, "rArr");
	Результат.Вставить(8594, "rarr");
	Результат.Вставить(8969, "rceil");
	Результат.Вставить(8221, "rdquo");
	Результат.Вставить(8476, "real");
	Результат.Вставить(174 , "reg");
	Результат.Вставить(8971, "rfloor");
	Результат.Вставить(929 , "Rho");
	Результат.Вставить(961 , "rho");
	Результат.Вставить(8207, "rlm");
	Результат.Вставить(8250, "rsaquo");
	Результат.Вставить(8217, "rsquo");

	Результат.Вставить(8218, "sbquo");
	Результат.Вставить(352 , "Scaron");
	Результат.Вставить(353 , "scaron");
	Результат.Вставить(8901, "sdot");
	Результат.Вставить(167 , "sect");
	Результат.Вставить(173 , "shy");
	Результат.Вставить(931 , "Sigma");
	Результат.Вставить(963 , "sigma");
	Результат.Вставить(962 , "sigmaf");
	Результат.Вставить(8764, "sim");
	Результат.Вставить(9824, "spades");
	Результат.Вставить(8834, "sub");
	Результат.Вставить(8838, "sube");
	Результат.Вставить(8721, "sum");
	Результат.Вставить(8835, "sup");
	Результат.Вставить(185 , "sup1");
	Результат.Вставить(178 , "sup2");
	Результат.Вставить(179 , "sup3");
	Результат.Вставить(8839, "supe");
	Результат.Вставить(223 , "szlig");

	Результат.Вставить(932 , "Tau");
	Результат.Вставить(964 , "tau");
	Результат.Вставить(8756, "there4");
	Результат.Вставить(920 , "Theta");
	Результат.Вставить(952 , "theta");
	Результат.Вставить(977 , "thetasym");
	Результат.Вставить(8201, "thinsp");
	Результат.Вставить(222 , "THORN");
	Результат.Вставить(254 , "thorn");
	Результат.Вставить(732 , "tilde");
	Результат.Вставить(215 , "times");
	Результат.Вставить(8482, "trade");

	Результат.Вставить(250 , "uacute");
	Результат.Вставить(218 , "Uacute");
	Результат.Вставить(8657, "uArr");
	Результат.Вставить(8593, "uarr");
	Результат.Вставить(251 , "ucirc");
	Результат.Вставить(219 , "Ucirc");
	Результат.Вставить(217 , "Ugrave");
	Результат.Вставить(249 , "ugrave");
	Результат.Вставить(168 , "uml");
	Результат.Вставить(978 , "upsih");
	Результат.Вставить(965 , "upsilon");
	Результат.Вставить(933 , "Upsilon");
	Результат.Вставить(252 , "uuml");
	Результат.Вставить(220 , "Uuml");

	Результат.Вставить(8472, "weierp");

	Результат.Вставить(958 , "xi");
	Результат.Вставить(926 , "Xi");

	Результат.Вставить(253 , "yacute");
	Результат.Вставить(221 , "Yacute");
	Результат.Вставить(165 , "yen");
	Результат.Вставить(255 , "yuml");
	Результат.Вставить(376 , "Yuml");

	Результат.Вставить(918 , "Zeta");
	Результат.Вставить(950 , "zeta");
	Результат.Вставить(8205, "zwj");
	Результат.Вставить(8204, "zwnj");

	Возврат Результат;

КонецФункции

// Возвращает соответствие для обратной замены спецсимволов.
// 
// Возвращаемое значение:
//  Соответствие - Соответствие имен спецсимволов и их кодов.
//
Функция ПолучитьОбратноеСоответствиеСпецСимволов() Экспорт

	Результат = Новый Соответствие;

	Результат.Вставить("Aacute" , 193);
	Результат.Вставить("aacute" , 225);
	Результат.Вставить("acirc"  , 226);
	Результат.Вставить("Acirc"  , 194);
	Результат.Вставить("acute"  , 180);
	Результат.Вставить("aelig"  , 230);
	Результат.Вставить("AElig"  , 198);
	Результат.Вставить("Agrave" , 192);
	Результат.Вставить("agrave" , 224);
	Результат.Вставить("alefsym", 8501);
	Результат.Вставить("Alpha"  , 913);
	Результат.Вставить("alpha"  , 945);
	Результат.Вставить("and"    , 8743);
	Результат.Вставить("ang"    , 8736);
	Результат.Вставить("aring"  , 229);
	Результат.Вставить("Aring"  , 197);
	Результат.Вставить("asymp"  , 8776);
	Результат.Вставить("Atilde" , 195);
	Результат.Вставить("atilde" , 227);
	Результат.Вставить("Auml"   , 196);
	Результат.Вставить("auml"   , 228);

	Результат.Вставить("bdquo" , 8222);
	Результат.Вставить("Beta"  , 914);
	Результат.Вставить("beta"  , 946);
	Результат.Вставить("brvbar", 166);
	Результат.Вставить("bull"  , 8226);

	Результат.Вставить("cap"   , 8745);
	Результат.Вставить("Ccedil", 199);
	Результат.Вставить("ccedil", 231);
	Результат.Вставить("cedil" , 184);
	Результат.Вставить("cent"  , 162);
	Результат.Вставить("chi"   , 967);
	Результат.Вставить("Chi"   , 935);
	Результат.Вставить("circ"  , 710);
	Результат.Вставить("clubs" , 9827);
	Результат.Вставить("cong"  , 8773);
	Результат.Вставить("copy"  , 169);
	Результат.Вставить("crarr" , 8629);
	Результат.Вставить("cup"   , 8746);
	Результат.Вставить("curren", 164);

	Результат.Вставить("dagger", 8224);
	Результат.Вставить("Dagger", 8225);
	Результат.Вставить("dArr"  , 8659);
	Результат.Вставить("darr"  , 8595);
	Результат.Вставить("deg"   , 176);
	Результат.Вставить("Delta" , 916);
	Результат.Вставить("delta" , 948);
	Результат.Вставить("diams" , 9830);
	Результат.Вставить("divide", 247);

	Результат.Вставить("eacute" , 233);
	Результат.Вставить("Eacute" , 201);
	Результат.Вставить("Ecirc"  , 202);
	Результат.Вставить("ecirc"  , 234);
	Результат.Вставить("egrave" , 232);
	Результат.Вставить("Egrave" , 200);
	Результат.Вставить("empty"  , 8709);
	Результат.Вставить("emsp"   , 8195);
	Результат.Вставить("ensp"   , 8194);
	Результат.Вставить("epsilon", 949);
	Результат.Вставить("Epsilon", 917);
	Результат.Вставить("equiv"  , 8801);
	Результат.Вставить("Eta"    , 919);
	Результат.Вставить("eta"    , 951);
	Результат.Вставить("eth"    , 240);
	Результат.Вставить("ETH"    , 208);
	Результат.Вставить("euml"   , 235);
	Результат.Вставить("Euml"   , 203);
	Результат.Вставить("euro"   , 8364);
	Результат.Вставить("exist"  , 8707);

	Результат.Вставить("fnof"  , 402);
	Результат.Вставить("forall", 8704);
	Результат.Вставить("frac12", 189);
	Результат.Вставить("frac14", 188);
	Результат.Вставить("frac34", 190);
	Результат.Вставить("frasl" , 8260);

	Результат.Вставить("Gamma", 915);
	Результат.Вставить("gamma", 947);
	Результат.Вставить("ge"   , 8805);
	Результат.Вставить("gt"   , 62);

	Результат.Вставить("hArr"  , 8660);
	Результат.Вставить("harr"  , 8596);
	Результат.Вставить("hearts", 9829);
	Результат.Вставить("hellip", 8230);

	Результат.Вставить("iacute", 237);
	Результат.Вставить("Iacute", 205);
	Результат.Вставить("icirc" , 238);
	Результат.Вставить("Icirc" , 206);
	Результат.Вставить("iexcl" , 161);
	Результат.Вставить("Igrave", 204);
	Результат.Вставить("igrave", 236);
	Результат.Вставить("image" , 8465);
	Результат.Вставить("infin" , 8734);
	Результат.Вставить("int"   , 8747);
	Результат.Вставить("Iota"  , 921);
	Результат.Вставить("iota"  , 953);
	Результат.Вставить("iquest", 191);
	Результат.Вставить("isin"  , 8712);
	Результат.Вставить("Iuml"  , 207);
	Результат.Вставить("iuml"  , 239);
	Результат.Вставить("Kappa" , 922);
	Результат.Вставить("kappa" , 954);

	Результат.Вставить("lambda", 955);
	Результат.Вставить("Lambda", 923);
	Результат.Вставить("lang"  , 9001);
	Результат.Вставить("laquo" , 171);
	Результат.Вставить("larr"  , 8592);
	Результат.Вставить("lArr"  , 8656);
	Результат.Вставить("lceil" , 8968);
	Результат.Вставить("ldquo" , 8220);
	Результат.Вставить("le"    , 8804);
	Результат.Вставить("lfloor", 8970);
	Результат.Вставить("lowast", 8727);
	Результат.Вставить("loz"   , 9674);
	Результат.Вставить("lrm"   , 8206);
	Результат.Вставить("lsaquo", 8249);
	Результат.Вставить("lsquo" , 8216);
	Результат.Вставить("lt"    , 60);

	Результат.Вставить("macr"  , 175);
	Результат.Вставить("mdash" , 8212);
	Результат.Вставить("micro" , 181);
	Результат.Вставить("middot", 183);
	Результат.Вставить("minus" , 8722);
	Результат.Вставить("Mu"    , 924);
	Результат.Вставить("mu"    , 956);

	Результат.Вставить("nabla" , 8711);
	Результат.Вставить("nbsp"  , 160);
	Результат.Вставить("ndash" , 8211);
	Результат.Вставить("ne"    , 8800);
	Результат.Вставить("ni"    , 8715);
	Результат.Вставить("not"   , 172);
	Результат.Вставить("notin" , 8713);
	Результат.Вставить("nsub"  , 8836);
	Результат.Вставить("ntilde", 241);
	Результат.Вставить("Ntilde", 209);
	Результат.Вставить("Nu"    , 925);
	Результат.Вставить("nu"    , 957);

	Результат.Вставить("oacute" , 243);
	Результат.Вставить("Oacute" , 211);
	Результат.Вставить("Ocirc"  , 212);
	Результат.Вставить("ocirc"  , 244);
	Результат.Вставить("OElig"  , 338);
	Результат.Вставить("oelig"  , 339);
	Результат.Вставить("ograve" , 242);
	Результат.Вставить("Ograve" , 210);
	Результат.Вставить("oline"  , 8254);
	Результат.Вставить("omega"  , 969);
	Результат.Вставить("Omega"  , 937);
	Результат.Вставить("Omicron", 927);
	Результат.Вставить("omicron", 959);
	Результат.Вставить("oplus"  , 8853);
	Результат.Вставить("or"     , 8744);
	Результат.Вставить("ordf"   , 170);
	Результат.Вставить("ordm"   , 186);
	Результат.Вставить("Oslash" , 216);
	Результат.Вставить("oslash" , 248);
	Результат.Вставить("Otilde" , 213);
	Результат.Вставить("otilde" , 245);
	Результат.Вставить("otimes" , 8855);
	Результат.Вставить("Ouml"   , 214);
	Результат.Вставить("ouml"   , 246);

	Результат.Вставить("para"  , 182);
	Результат.Вставить("part"  , 8706);
	Результат.Вставить("permil", 8240);
	Результат.Вставить("perp"  , 8869);
	Результат.Вставить("phi"   , 966);
	Результат.Вставить("Phi"   , 934);
	Результат.Вставить("Pi"    , 928);
	Результат.Вставить("pi"    , 960);
	Результат.Вставить("piv"   , 982);
	Результат.Вставить("plusmn", 177);
	Результат.Вставить("pound" , 163);
	Результат.Вставить("Prime" , 8243);
	Результат.Вставить("prime" , 8242);
	Результат.Вставить("prod"  , 8719);
	Результат.Вставить("prop"  , 8733);
	Результат.Вставить("psi"   , 968);
	Результат.Вставить("Psi"   , 936);

	Результат.Вставить("quot"  , 34);

	Результат.Вставить("radic" , 8730);
	Результат.Вставить("rang"  , 9002);
	Результат.Вставить("raquo" , 187);
	Результат.Вставить("rArr"  , 8658);
	Результат.Вставить("rarr"  , 8594);
	Результат.Вставить("rceil" , 8969);
	Результат.Вставить("rdquo" , 8221);
	Результат.Вставить("real"  , 8476);
	Результат.Вставить("reg"   , 174);
	Результат.Вставить("rfloor", 8971);
	Результат.Вставить("Rho"   , 929);
	Результат.Вставить("rho"   , 961);
	Результат.Вставить("rlm"   , 8207);
	Результат.Вставить("rsaquo", 8250);
	Результат.Вставить("rsquo" , 8217);

	Результат.Вставить("sbquo" , 8218);
	Результат.Вставить("Scaron", 352);
	Результат.Вставить("scaron", 353);
	Результат.Вставить("sdot"  , 8901);
	Результат.Вставить("sect"  , 167);
	Результат.Вставить("shy"   , 173);
	Результат.Вставить("Sigma" , 931);
	Результат.Вставить("sigma" , 963);
	Результат.Вставить("sigmaf", 962);
	Результат.Вставить("sim"   , 8764);
	Результат.Вставить("spades", 9824);
	Результат.Вставить("sub"   , 8834);
	Результат.Вставить("sube"  , 8838);
	Результат.Вставить("sum"   , 8721);
	Результат.Вставить("sup"   , 8835);
	Результат.Вставить("sup1"  , 185);
	Результат.Вставить("sup2"  , 178);
	Результат.Вставить("sup3"  , 179);
	Результат.Вставить("supe"  , 8839);
	Результат.Вставить("szlig" , 223);

	Результат.Вставить("Tau"     , 932);
	Результат.Вставить("tau"     , 964);
	Результат.Вставить("there4"  , 8756);
	Результат.Вставить("Theta"   , 920);
	Результат.Вставить("theta"   , 952);
	Результат.Вставить("thetasym", 977);
	Результат.Вставить("thinsp"  , 8201);
	Результат.Вставить("THORN"   , 222);
	Результат.Вставить("thorn"   , 254);
	Результат.Вставить("tilde"   , 732);
	Результат.Вставить("times"   , 215);
	Результат.Вставить("trade"   , 8482);

	Результат.Вставить("uacute" , 250);
	Результат.Вставить("Uacute" , 218);
	Результат.Вставить("uArr"   , 8657);
	Результат.Вставить("uarr"   , 8593);
	Результат.Вставить("ucirc"  , 251);
	Результат.Вставить("Ucirc"  , 219);
	Результат.Вставить("Ugrave" , 217);
	Результат.Вставить("ugrave" , 249);
	Результат.Вставить("uml"    , 168);
	Результат.Вставить("upsih"  , 978);
	Результат.Вставить("upsilon", 965);
	Результат.Вставить("Upsilon", 933);
	Результат.Вставить("uuml"   , 252);
	Результат.Вставить("Uuml"   , 220);

	Результат.Вставить("weierp", 8472);

	Результат.Вставить("xi", 958);
	Результат.Вставить("Xi", 926);

	Результат.Вставить("yacute", 253);
	Результат.Вставить("Yacute", 221);
	Результат.Вставить("yen"   , 165);
	Результат.Вставить("yuml"  , 255);
	Результат.Вставить("Yuml"  , 376);

	Результат.Вставить("Zeta", 918);
	Результат.Вставить("zeta", 950);
	Результат.Вставить("zwj" , 8205);
	Результат.Вставить("zwnj", 8204);

	Возврат Результат;

КонецФункции

// Возвращает список допустимых в URI спецсимволов.
// 
// Возвращаемое значение:
//  СписокЗначений - Список допустимых спецсимволов.
//
Функция ДопустимыеВURIСпецСимволы() Экспорт

	СписокДопустимыхСпецСимволов = Новый СписокЗначений;

	СписокДопустимыхСпецСимволов.Добавить("amp");
	СписокДопустимыхСпецСимволов.Добавить("quot");
	СписокДопустимыхСпецСимволов.Добавить("gt");
	СписокДопустимыхСпецСимволов.Добавить("lt");

	Возврат СписокДопустимыхСпецСимволов;

КонецФункции

// Возвращает список значимых в URI спецсимволов.
// 
// Возвращаемое значение:
//  СписокЗначений - Список допустимых спецсимволов.
//
Функция ЗначимыеВURIСпецСимволы() Экспорт

	СписокДопустимыхСпецСимволов = Новый СписокЗначений;

	СписокДопустимыхСпецСимволов.Добавить("quot");

	Возврат СписокДопустимыхСпецСимволов;

КонецФункции

// Возвращает список ограничителей, используемых в URI.
// 
// Возвращаемое значение:
//  СписокЗначений - Список ограничителей URI.
//
Функция СписокОграничителейURI() Экспорт

	СписокОграничителейURI = Новый СписокЗначений;

	// Основные разделители
	СписокОграничителейURI.Добавить(":");
	СписокОграничителейURI.Добавить("?");
	СписокОграничителейURI.Добавить("#");
	СписокОграничителейURI.Добавить("[");
	СписокОграничителейURI.Добавить("]");
	СписокОграничителейURI.Добавить("@");

	// Побочные разделители
	СписокОграничителейURI.Добавить("!");
	СписокОграничителейURI.Добавить("$");
	СписокОграничителейURI.Добавить("&");
	СписокОграничителейURI.Добавить("'");
	СписокОграничителейURI.Добавить("(");
	СписокОграничителейURI.Добавить(")");
	СписокОграничителейURI.Добавить("*");
	СписокОграничителейURI.Добавить("+");
	СписокОграничителейURI.Добавить(",");
	СписокОграничителейURI.Добавить(";");
	СписокОграничителейURI.Добавить("=");

	// Незарезервированные символы
	СписокОграничителейURI.Добавить("-");
	СписокОграничителейURI.Добавить(".");
	СписокОграничителейURI.Добавить("_");
	СписокОграничителейURI.Добавить("~");

	// Кодирующий символ
	СписокОграничителейURI.Добавить("%");

	// Дополнительный символ
	СписокОграничителейURI.Добавить("|");
	СписокОграничителейURI.Добавить("^");

	Возврат СписокОграничителейURI;

КонецФункции

// Список ограничений HTML, которые могут стоять перед ссылкой
//  > - закрытие какого-либо тега перед ссылкой.
// 
// Возвращаемое значение:
//  СписокЗначений - Список допустимых имен.
//
Функция СписокДопустимыхВСсылкеТегов() Экспорт

	СписокДопустимыхВСсылкеТегов = Новый СписокЗначений;

	СписокДопустимыхВСсылкеТегов.Добавить("FONT");
	СписокДопустимыхВСсылкеТегов.Добавить("SPAN");
	СписокДопустимыхВСсылкеТегов.Добавить("STRONG");
	СписокДопустимыхВСсылкеТегов.Добавить("EM");
	СписокДопустимыхВСсылкеТегов.Добавить("B");
	СписокДопустимыхВСсылкеТегов.Добавить("I");
	СписокДопустимыхВСсылкеТегов.Добавить("U");

	Возврат СписокДопустимыхВСсылкеТегов;

КонецФункции

// Возвращает все списки со специальными символами за один вызов сервера.
// 
// Возвращаемое значение:
//  Структура - Структура, содержащая списки специальных символов.
//
Функция ПолучитьСпискиСимволов() Экспорт

	Списки = Новый Структура();
	Списки.Вставить("ДопустимыеВURIСпецСимволы", ДопустимыеВURIСпецСимволы());
	Списки.Вставить("ЗначимыеВURIСпецСимволы", ЗначимыеВURIСпецСимволы());
	Списки.Вставить("ОбратноеСоответствиеСпецСимволов", ПолучитьОбратноеСоответствиеСпецСимволов());
	Списки.Вставить("СписокДопустимыхВСсылкеТегов", СписокДопустимыхВСсылкеТегов());

	Возврат Списки;

КонецФункции

#КонецОбласти