
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВывестиПротокол(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Текст", РаботаСПротоколомСобытийВызовСервера.ПолучитьТекстПротокола());

	ОткрытьФорму("ОбщаяФорма.ОтображениеПротоколаСобытий", ПараметрыФормы, ЭтаФорма,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПротокол(Команда)

	ОчиститьПротоколСервер();
	Элементы.Список.Обновить();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ОчиститьПротоколСервер()

	Набор = РегистрыСведений.ПротоколСобытий.СоздатьНаборЗаписей();
	Набор.Записать();

КонецПроцедуры

#КонецОбласти

